LEXICON: dict[str, str] = {
    'forward': '>>',
    'backward': '<<',
    '/start': '<b>Добрый день</b>\n\nЯ информационный бот, '
              'готовый помочь вам получить актуальные сведения и ответы на различные вопросы.  '
              '\n\nЧтобы посмотреть список доступных '
              'команд - набери /help',
    '/help': '<b>Это информационный бот</b>\n\nДоступные команды:\n\n/begin - '
             'перейти в начало каталога\n/continue - продолжить '
             'чтение\n/bookmarks - посмотреть список закладок\n/help - '
             'справка по работе бота\n\nЧтобы сохранить закладку - '
             'нажмите на кнопку с номером страницы\n\n<b>Приятного чтения!</b>',
}

LEXICON_COMMANDS: dict[str, str] = {
    '/begin': 'Открыть справочник',
    '/help': 'Справка по работе бота'
}

GREETING_TEXT: dict[str, str] = {
    'greeting': 'Добро пожаловатьб я такой вот бот который помогать'
}

CHICKEN_EGG_TEXT: dict[int, str] = {
    1: 'Несушки Леггорны отличаются высокой яйценоскостью и являются рекордсменками среди всех яичных пород кур. '
    'Масса взрослых самцов – около 2,4-2,6 кг, а у курочек – до 1,8 кг. Несушки могут откладывать до 240-280 яиц в '
    'год. Вес яиц может достигать 58-60 г. Окрас прочной скорлупы – белый. Петухи оплодотворяют до 95-96% яиц. '
    'Жизнеспособность вылупившихся птенцов высокая – выживает порядка 96-97% молодняка.  Инстинкт насиживание '
    'отсутствует.\n\n'
        'Имеют разные расцветки:\n'
        'Белый\n'
        'Кукущечный\n'
        'Лаванда\n'
        'Долматинец\n'
        'И др\n',
    2: '2b',
}


