LEXICON_COMMANDS: dict[str, str] = {
    '/begin': 'Открыть справочник',
    '/help': 'Справка по работе бота',
    '/order': 'Заполнить форму для заказа'
}

GREETING_TEXT: dict[str, str] = {
    'greeting': 'Добро пожаловатьб я такой вот бот который помогать'
}

CHICKEN_EGG_TEXT: dict[int, str] = {
    1: 'Несушки Леггорны отличаются высокой яйценоскостью и являются рекордсменками среди всех яичных пород кур. '
    'Масса взрослых самцов – около 2,4-2,6 кг, а у курочек – до 1,8 кг. Несушки могут откладывать до 240-280 яиц в '
    'год. Вес яиц может достигать 58-60 г. Окрас прочной скорлупы – белый. Петухи оплодотворяют до 95-96% яиц. '
    'Жизнеспособность вылупившихся птенцов высокая – выживает порядка 96-97% молодняка.  Инстинкт насиживание '
    'отсутствует.\n\n'
        'Имеют разные расцветки:\n'
        'Белый\n'
        'Кукущечный\n'
        'Лаванда\n'
        'Долматинец\n'
        'И др\n',
    2: '2b',
    3: '3b',
    4: '4b',
}

CHICKEN_EGG_MEAT_TEXT: dict[int, str] = {
    1: '1a',
    2: '2b',
    3: '3b',
    4: '4b',
}

CHICKEN_MEAT_TEXT: dict[int, str] = {
    1: '1a',
    2: '2b',
}

DUCK_EGG_TEXT: dict[int, str] = {
    1: 'Несушки Леггорны отличаются высокой яйценоскостью и являются рекордсменками среди всех яичных пород кур. '
    'Масса взрослых самцов – около 2,4-2,6 кг, а у курочек – до 1,8 кг. Несушки могут откладывать до 240-280 яиц в '
    'год. Вес яиц может достигать 58-60 г. Окрас прочной скорлупы – белый. Петухи оплодотворяют до 95-96% яиц. '
    'Жизнеспособность вылупившихся птенцов высокая – выживает порядка 96-97% молодняка.  Инстинкт насиживание '
    'отсутствует.\n\n'
        'Имеют разные расцветки:\n'
        'Белый\n'
        'Кукущечный\n'
        'Лаванда\n'
        'Долматинец\n'
        'И др\n',
}

DUCK_EGG_MEAT_TEXT: dict[int, str] = {
    1: '1a',
    2: '2b',
}

DUCK_MEAT_TEXT: dict[int, str] = {
    1: '1a',
    2: '2b',
    3: '3c',
}

GOOSE_EGG_TEXT: dict[int, str] = {
    1: 'Несушки Леггорны отличаются высокой яйценоскостью и являются рекордсменками среди всех яичных пород кур. '
    'Масса взрослых самцов – около 2,4-2,6 кг, а у курочек – до 1,8 кг. Несушки могут откладывать до 240-280 яиц в '
    'год. Вес яиц может достигать 58-60 г. Окрас прочной скорлупы – белый. Петухи оплодотворяют до 95-96% яиц. '
    'Жизнеспособность вылупившихся птенцов высокая – выживает порядка 96-97% молодняка.  Инстинкт насиживание '
    'отсутствует.\n\n'
        'Имеют разные расцветки:\n'
        'Белый\n'
        'Кукущечный\n'
        'Лаванда\n'
        'Долматинец\n'
        'И др\n',
}

GOOSE_EGG_MEAT_TEXT: dict[int, str] = {
    1: '1a',
    2: '2b',
}

GOOSE_MEAT_TEXT: dict[int, str] = {
    1: '1a',
    2: '2b',
    3: '3c',
}